{
  "speakers" : [
    {
      "firstname" : "Eric",
      "lastname" : "Breitenbach",
      "category" : "Film",
      "image" : "/images/speaker_ericbreitenbach.jpg",
      "link" : "http://ericbreitenbach.com",
      "title" : "Getting Independent Documentaries off the ground",
      "bio" : "Eric Breitenbach has been a still photographer for over thirty years and a filmmaker for more than fifteen. His still photographs have appeared in The New York Times Magazine, Newsweek, Details and  Information Week. In 1989 he began working in film and video, and since then has produced documentaries for National Geographic Explorer, The Sundance Channel, The Sci-Fi Channel, Lifetime Real Women, America’s Health Network, PBS, and Florida Public Television. Eric Breitenbach has served on the Florida Film and Entertainment Advisory Committee, a panel that reports to the Governor on issues related to statewide media production. He has been a full-time professor in the Daytona State College’s renowned Photography Department since 1981.",
      "description" : "In addition to discussing innovative ways of producing video documentaries, Daytona State College senior professor Eric Breitenbach will present information on the exhibition, distribution and broadcast potential of contemporary independent film."
    },
    {
      "firstname" : "Mark",
      "lastname" : "Cahill",
      "category" : "Development",
      "image" : "/images/speaker_markcahill.jpg",
      "link" : "http://www.thinkjson.com",
      "title" : "Big Data, What is it, and how do I know when I have it?",
      "bio" : "Mark is the Data Analyst and Developer at YouVersion - the Bible App, a top-100 mobile application with over 60 million users and counting. His goal is to enable YouVersion to utilize their data to more effectively engage our users with the Bible. I am passionate about scalable web services and elegant user interfaces, and feel that the web provides a unique opportunity to change the way we think about software and the way we interact with it.",
      "description" : "In this talk, Mark will explain the buzz around the term Big Data, attempt to narrow down when you've got it, and some methods for dealing with large quantities of data. He'll explain what MapReduce is and show some examples of the types of MapReduce they do at YouVersion. Finally, he'll talk about Hadoop, and how Amazon makes it easy for anyone to pull meaningful aggregations out of GBs or TBs of raw data."
    },
    {
      "firstname" : "Kelly and Courtney",
      "lastname" : "Canova",
      "category" : "Photography",
      "image" : "/images/speaker_kellyandcourtneycanova.jpg",
      "title" : "The Anatomy of Creative Inspiration",
      "link" : "http://kellycanovaphotos.com",
      "bio" : "Kelly and Courtney Canova are award-winning artists that specialize in artistic wedding photography and graphic design. Both with degrees in art and design fields from The Ringling School of Art and the Art Institute of Ft. Lauderdale, they have a passion for their work, relationships with clients and communication through visual means.",
      "description" : "Kelly and Courtney will show you how to assemble and transform a comprehensive expression of art into a marketable business proposition. Learn from the pros how to carefully select and position your image through photo shoots, print ads and more as they talk about the anatomy of executing an idea, breaking down the elements of photography and maintaining communication with clients."
    },
    {
      "firstname" : "Stephen John Ellis",
      "lastname" : "Ellis",
      "category" : "Arts",
      "image" : "/images/speaker_stephenjohnellis.jpg",
      "title" : "Contemporary Art in the Virtual World",
      "link" : "http://kellycanovaphotos.com",
      "bio" : "Stephen John Ellis is a mixed-media artist employing digital video, electronic media and 3d design. His work argues for identity as a socio-aesthetic hybrid in an attempt to explain representations of self through the visual language of virtual realities. Ellis has worked as a freelance media artist and educator for several years and has exhibited both nationally and internationally, including China, Korea, Canada, Bulgaria and throughout the United States. Ellis was most recently an artist-in-residence at the Chashama residency in New York and will be in residence at the Nes Project in Iceland next May. He is currently a visiting lecturer of digital media at Stetson University.",
      "description" : "Ellis will focus his talk on the state of contemporary art in the virtual online world of Second Life. Examining everything from photography and machinima to performance and interactivity, Ellis will look at not only how Second Life has become a new creative frontier for visual artists, but also the implications this new social space has had on our culture as a whole."
    },
    {
      "firstname" : "David",
      "lastname" : "Foster",
      "category" : "Entrepreneurship",
      "image" : "/images/speaker_davidfoster.jpg",
      "title" : "Getting funded! Angels, VCs and Kickstarter",
      "link" : "http://wireless-nrg.com/nrg/",
      "bio" : "Combining the strengths ingrained in him from his father as an entrepreneur, and grandfather as an inventor and leading engineer for NASA, David Foster has devoted a life of creativity, ingenuity, and action. David strives to be the leader in any task - proven since the age of 10, by 21 he had started a telecommunications wholesale/distribution company from scratch learning the real world of business practices. In 2007 he sold the business to focus more time on converting the Earth’s gravity into electricity. His products, ideas, business concepts, and marketing strategies have evolved into a company known as Wireless NRG. He believes in proven strategies as a foundation for a business model while creating paths for others to follow.",
      "description" : "David will be talking about the challenges you can expect and what system you need in place to turn an idea into a product people are buying off the shelf.  This would cover the design, engineering, and R&D stage, the funding stage including Angel Investors, Venture Capitalist, and crowd funding like Kickstarter.  The hurdles of manufacturing and mass production, and finally search engine optimization, social media, celebrity marketing and the packaging design needed to get the product out the door"
    },
    {
      "firstname" : "Martha",
      "lastname" : "Garzon",
      "category" : "Business",
      "title" : "Understanding Branding: How to define, build & improve your business presence",
      "image" : "/images/speaker_marthagarzon.jpg",
      "link" : "http://m5designstudio.com",
      "bio" : "Martha Garzon is a creative director, educator & web/graphic designer. After studying visual arts at the National University in Bogota, she moved to the US where she acquired a B.A. in Digital Arts from Stetson University. She has been teaching multimedia, web development, photography and design since 2004 and currently teaches at the Digital Arts Program at Stetson University and is the founder/owner of M5 Design Studio.",
      "description" : "Branding is more than a name and a logo. Regardless if you are a large, small, or non profit organization, you can use the power of branding to connect with your customers, while enhancing your business visibility and credibility. This talk features real examples of successful brands that will help you understand how to improve and take control of your business presence."
    },
    {
      "firstname" : "Michael E",
      "lastname" : "Jaeckle",
      "category" : "Development",
      "title" : "Easy Video Game Development with XNA",
      "image" : "/images/speaker_michaelejaeckle.jpg",
      "bio" : "Most kids from the '80s remember playing games on the Atari 2600. Michael had the Atari 2600's cousin the Atari 400. It had a keyboard, an option for tape back up, and most importantly a BASIC programming language cartridge. This sparked his interest in programming and love of video games. Since he discovered you can independently program and sell games for the Xbox 360 console, he's working to learn more about XNA coding which is the basis of quick video game development for Windows, Windows Phone 7 and the Xbox 360.",
      "description" : "Michael will show you the free development tools available to indie game developers, introduce you the the game loop, show you how the parts work together as he codes a simple game, and what it takes to get your game published to it."
    },
    {
      "firstname" : "Michael",
      "lastname" : "Kappers",
      "category" : "3D",
      "title" : "No glasses required",
      "image" : "/images/speaker_michaelkappers.jpg",
      "link" : "http://www.purekapp.com",
      "bio" : "Michael holds a Master of Fine Arts degree from the University of Central Florida. His undergraduate degree is in Fine Arts with a concentration in Graphic Design from George Mason University. Prior to teaching, Michael cut his teeth in the world of 3D graphics by developing Computer Based simulation and Training for the military. He also worked in the gaming industry and was on the team that developed titles including Duke Nukem Time to Kill and Die Hard Trilogy.",
      "description" : "Michael Kappers, the Program Manager of Digital Media at Seminole State College, will give a talk and demonstration about basic modeling techniques in a 3D environment. Michael will also introduce the creation and application of shaders and materials. In addition he will demonstrate the animation process and examine how objects move in real life and emulate the movement in CG."
    },
    {
      "firstname" : "Clark",
      "lastname" : "Orr",
      "category" : "Design",
      "title" : "Design Process & Style",
      "image" : "/images/speaker_clarkorr.jpg",
      "link" : "http://clarkorr.squarespace.com",
      "bio" : "Clark Orr, a native DeLand, FL resident is a freelance graphic designer and illustrator whose focus is primarily in branding, print, packaging, and apparel design. Clark currently splits his time as a Head Designer for the Boston-based t-shirt brand Johnny Cupcakes and working as a contracted designer for brands such as: Nike, The Hundreds, Benny Gold, Rebel 8, & several others.",
      "description" : "Clark has given lectures on his story, design theory, and business practice to UCF, Stetson University, and Daytona State College. At Bar Camp DeLand, Clark will be giving a presentation on The Design Process, Practices, and Style."
    },
    {
      "firstname" : "Matt",
      "lastname" : "Roberts",
      "category" : "Music",
      "title" : "Traditional Music goes Interactive",
      "image" : "/images/speaker_mattroberts.jpg",
      "link" : "http://www2.stetson.edu/diga/",
      "bio" : "Matt Roberts is a new media artist specializing in real-time video performance and new media applications. His work has been featured internationally and nationally, including shows in Brazil, Canada, Argentina, Italy, Mexico and in New York, San Francisco, Miami, and Chicago. He has shown in several new media festivals including ISEA, FILE, 404, CONFLUX, and he recently received the Transitio award from the Transitio_MX Festival in Mexico City. He is the founder of MPG: Mobile Performance Group , and an Associate Professor of Digital Art at Stetson University.",
      "description" : "Matt Roberts will give a talk and demonstration on how to turn traditional musical instruments into interactive devices to control the playback and manipulation of video and audio in real-time."
    },
    {
      "firstname" : "Ray",
      "lastname" : "Villalobos",
      "category" : "Front End",
      "title" : "Bootstrap & CSS Preprocessors",
      "image" : "/images/speaker_rayvillalobos.jpg",
      "link" : "http://planetoftheweb.com",
      "bio" : "Ray Villalobos is a full-time author and teacher at lynda.com. He is author of the book, Exploring Multimedia for Designers. He has more than 20 years experience in developing and programming multimedia projects. Previously at Entravision Communications, he designed and developed a network of radio station and TV web sites. As a senior producer for Tribune Interactive, he was responsible for designing orlandosentinel.com and for creating immersive multimedia projects and Flash games for the site.",
      "description" : "As responsive design continues to take over the web, front-end developers and designers have turned to preprocessors and layout systems that simplify their workflow. Lynda.com staff author Ray Villalobos will talk about using the Bootstrap framework from Twitter to scaffold and fast track your responsive design. He'll talk about how you can use CodeKit and LESS to put together designs in hours instead of days."
    },
    {
      "firstname" : "Gordon",
      "lastname" : "Worley",
      "category" : "Development",
      "title" : "From Python to Ruby",
      "image" : "/images/speaker_gordonworley.jpg",
      "link" : "http://korrelate.com",
      "bio" : "Gordon is a software engineer at Korrelate. Programming since about 1990, he started out on a VIC-20, graduated to QBASIC, and then finally got into 'real' programming languages with Java and Python. With over 20 years of programming experience, he's worked on projects ranging from low-level encryption to iPhone apps to large batch processing and many points in between. He is currently focused on privacy-safe big data analytics in online advertising.",
      "description" : "Gordon started out as a Python programmer. In the intervening years I've done lots of different things, but Python was for a long time my 'native' language. But for the past year and a half I've been programming Ruby and it has quickly replaced Python as my language of choice. In this talk I'll describe why I like Ruby so much and how my various programming experiences have led me to like Ruby so much."
    }
  ]
}